[
  {
    "_id": "63595494527bcd42af10f106",
    "name": " Python For EveryBody",
    "price": 150,
    "category_id": "01",
    "img": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://s3.amazonaws.com/coursera-course-photos/08/33f720502a11e59e72391aa537f5c9/pythonlearn_thumbnail_1x1.png?auto=format%2Ccompress&dpr=1&w=330&h=330&fit=fill&q=25",

    "info": "You will learn : installing python and write your first program,describe the basic of the Python programming language,use variables to store , retrieve and calculate information and also utilizing core programming tools such as functions and loops",

    "about": "This Specialization builds on the success of the Python for Everybody course and will introduce fundamental programming concepts including data structures, networked application program interfaces, and databases, using the Python programming language. In the Capstone Project, you’ll use the technologies learned throughout the Specialization to design and create your own  applications for data retrieval, processing, and visualization."
  },
  {
    "_id": "635954945b93cc8ee170ae24",
    "name": "C Crash Course ",

    "category_id": "01",
    "price": 100,
    "img": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://s3.amazonaws.com/coursera-course-photos/fb/cec454765c477fb662f1f0f3315968/CThumbnail_PartB-02.jpg?auto=format%2Ccompress&dpr=1&w=330&h=330&q=25&fit=fill",

    "info": "This Specialization is intended for all programming enthusiasts, as well as beginners, computer and other scientists, and artificial intelligence enthusiasts seeking to develop their programming skills in the foundational languages of C and C++. Through the four courses — two in C, and two in C++ — you will cover the basics of programming in C and move on to the more advanced C++ semantics and syntax, which will prepare you to apply these skills to a number of higher-level problems using AI algorithms and Monte Carlo evaluation in complex games.",

    "about": "In the new world we live in, coding is a universally valuable skill, whether you're a scientist, artist, or a humanist. Algorithms are everywhere, and we all have to understand how they work. The C language is particularly well suited as an introduction to coding: It's a tried-and-true language, and it allows you to understand computing processes at a deep level. You will also get an introduction to more advanced programming in C++ in the final module.This is a continuation of C for Everyone: Fundamentals, which you should take before beginning this course.The time estimated time commitment for this course is five hours a week for five weeks."
  },
  {
    "_id": "635954940770be53a6424288",
    "name": "Matlab for Beginners ",
    "category_id": "01",
    "price": 250,
    "img": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://s3.amazonaws.com/coursera-course-photos/88/95d1ba5b2d48fab009356787a26dff/SquareLogo.png?auto=format%2Ccompress&dpr=1&w=330&h=330&fit=fill&q=25",

    "info": "You will learn fundamental computer programming concepts such as variables, control structures, functions and many others,various data types and how to handle them in MATLAB,powerful support MATLAb provides for working with matrices.",

    "about": "This course teaches computer programming to those with little to no previous experience. It uses the programming system and language called MATLAB to do so because it is easy to learn, versatile and very useful for engineers and other professionals. MATLAB is a special-purpose language that is an excellent choice for writing moderate-size programs that solve problems involving the manipulation of numbers. The design of the language makes it possible to write a powerful program in a few lines. The problems may be relatively complex, while the MATLAB programs that solve them are relatively simple: relative, that is, to the equivalent program written in a general-purpose language, such as C++ or Java. As a result, MATLAB is being used in a wide variety of domains from the natural sciences, through all disciplines of engineering, to finance, and beyond, and it is heavily used in industry. Hence, a solid background in MATLAB is an indispensable skill in today’s job market.Nevertheless, this course is not a MATLAB tutorial. It is an introductory programming course that uses MATLAB to illustrate general concepts in computer science and programming. Students who successfully complete this course will become familiar with general concepts in computer science, gain an understanding of the general concepts of programming, and obtain a solid foundation in the use of MATLAB.Students taking the course will get a MATLAB Online license free of charge for the duration of the course. The students are encouraged to consult the eBook that this course is based on. More information about these resources can be found on the Resources menu on the right."
  },
  {
    "_id": "63595494d1c7b23a8a263145",
    "name": " Java : Beginners to Advance ",
    "category_id": "01",
    "price": 450,
    "img": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://d15cw65ipctsrr.cloudfront.net/03/d249a30ce84b50a94ed728933a78b9/JavaCupLogo800x800.png?auto=format%2Ccompress&dpr=1&w=330&h=330&fit=fill&q=25",

    "info": "Learn the basic syntax and functions of the Java programming language,Apply object-oriented programming techniques to building classes, creating objects, and understanding how solutions are packaged in Java,implement inheritance and polymorphism in Java,using selected parts of the vast Java SE class library to enhance your Java programming techniques.",

    "about": "In Course we will introduce you to the basic fundamentals of the Java language Course 2 provides a refresher on object-oriented programming  how you can apply OO to Java. We’ll introduce Java classes instances and packaging.By the time you get to course 3 you will be ready to go deeper into applying OOP concepts in Java including inheritance and polymorphism.In course 4 you will learn how to use selected parts of the Java SE Class LIbrary including Generics Collections Java Streams I/O Exceptions Annotations and Enums.While we'll touch on other important Java topics such as database connectivity Java EE and Spring those topics are covered in greater detail in other LearnQuest Java Specializations"
  },
  {
    "_id": "63595494de2c0be000362dd0",
    "name": " Swif Crash course ",
    "category_id": "01",
    "price": 290,
    "img": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://s3.amazonaws.com/coursera-course-photos/a6/826c6bebf34bb5951014a292a1a43a/intro-to-swift-logo.png?auto=format%2Ccompress&dpr=1&w=330&h=330&q=25&fit=fill",

    "info": "In this course how to install Xcode and other Swift tools to properly set up your development environment,how to program using Swift including strings, variables, constants and program logic,how to use data constructs and create reusable code segments,how to build common architectures for Swift and iOS development",
    "about": "In this course we will introduce you to the absolute basics of the Swift programming language.  Whether you are a brand new programmer or have experience with other programming languages this course is for you.Some of the things you will learn in this course are:An Introduction to Swift 5 programming concepts Installing the necessary tools Working with data such as Integers and Strings Creating reusable code with functions Working with data constructs such as arrays and dictionaries Object-oriented programming Model View ControllerBy the end of this course you will know how to build simple programs with the Swift programming language and you will be ready to learn iOS mobile development."
  },
  {
    "_id": "63595494e6b4c9a6b04b8361",
    "name": " C++ for Beginners ",
    "category_id": "01",
    "price": 199,
    "img": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://d15cw65ipctsrr.cloudfront.net/70/d28a28b3b24adc82008ce9acf33155/Specialization-Logo.png?auto=format%2Ccompress&dpr=1&w=330&h=330&fit=fill&q=25",

    "info": "Learn Graph Theory,C++11,C++,Graph Algorithms",

    "about": "This course is for experienced C programmers who want to program in C++. The examples and exercises require a basic understanding of algorithms and object-oriented software."
  },
  {
    "_id": "635954946c24f003ab285419",
    "name": "Basic HTML,CSS ",
    "category_id": "02",
    "price": 450,
    "img": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://s3.amazonaws.com/coursera-course-photos/e5/7aeafc636b47aa83ee4e5d7ac5f337/136528.png?auto=format%2Ccompress&dpr=1&w=330&h=330&fit=fill&q=25",
    "info": "Learn Debugging,User Interface,React (Web Framework)HTML and CSS",
    "about": "By the end of the course you will learn Create a simple form with a responsive layout using HTML5 and CSS Create a responsive layout using CSS Create a UI using Bootstrap Implement debugging tools.This is a beginner course for learners who would like to prepare themselves for a career in front-end development. To succeed in this course you do not need prior development experience  only basic internet navigation skills and an eagerness to get started with coding."
  },
  {
    "_id": "6359549471030d28ad70b171",
    "name": " HTML : Beginners to Advance",
    "category_id": "02",
    "price": 750,
    "img": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://s3.amazonaws.com/coursera-course-photos/32/b88140502611e5bf374909c194f0db/introhtml_thumnail_1x1.png?auto=format%2Ccompress&dpr=1&w=330&h=330&fit=fill&q=25",
    "info": "Skill you will gain Web Design,Web Accessibility,HTML,Html5",
    "about": "Thanks to a growing number of software programs it seems as if anyone can make a webpage But what if you actually want to understand how the page was created? There are great textbooks and online resources for learning web design but most of those resources require some background knowledge. This course is designed to help the novice who wants to gain confidence and knowledge. We will explore the theory (what actually happens when you click on a link on a webpage?) the practical (what do I need to know to make my own page?) and the overlooked (I have a page what do I do now?). Throughout the course there will be a strong emphasis on adhering to syntactic standards for validation and semantic standards to promote wide accessibility for users with disabilities  The textbook we use is available online “The Missing Link: An Introduction to Web Development and Programming” by Michael Mendez from www.opensuny.org This course will appeal to a wide variety of people but specifically those who would like a step-by-step description of the basics. There are no prerequisites for this course and it is assumed that students have no prior programming skills or IT experience. The course will culminate in a small final project that will require the completion of a very simple page with links and images.This is the first course in the Web Design For Everybody specialization. Subsequent courses focus on the marketable skills of styling the page with CSS3 adding interactivity with JavaScript and enhancing the styling with responsive design"
  },
  {
    "_id": "63595494a37774158b9ab36d",
    "name": " CSS Crash Course ",
    "category_id": "02",
    "price": 110,
    "img": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://s3.amazonaws.com/coursera-course-photos/9b/376180502811e5a352932b5892ee29/introcss_thumbnail_1x1.png?auto=format%2Ccompress&dpr=1&w=330&h=330&fit=fill&q=25",
    "info": "Skill you will gain Web Design,Style Sheets,Cascading Style Sheets (CSS),Web Development ",

    "about": "This course will show you the basics of Cascading Style Sheets (CSS3).The emphasis will be on learning how to write CSS rules how to test code and how to establish good programming habits.When done correctly the styling of a webpage can take enhance your page.   When done incorrectly the result can be worse than no styling at all To ensure that your sites do not put up  barriers for people with cognitive and/or physical disabilities you will learn how to evaluate pages using the standardized POUR accessibility guidelines.Upon completion of the course learners will be able to sketch a design for a given HTML page.  Using that design they will use CSS to implement the design by adding fonts colors and  layouts.This is the second course in the Web Design For Everybody specialization.   Subsequent courses focus on adding interaction with JavaScript and enhancing the styling with responsive design"
  },
  {
    "_id": "63595494a70757283c1343bb",
    "name": "Bootstrap Crash Course ",
    "category_id": "02",
    "price": 299,
    "img": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://s3.amazonaws.com/coursera-course-photos/31/6abd60669411e5939373fafc912bbf/Slide1.png?auto=format%2Ccompress&dpr=1&w=330&h=330&fit=fill&q=25",
    "info": "You will learn Bootstrap (Front-End Framework),SASS (Stylesheet Language)",
    "about": "At the end of this course you will be able to a)Set up design and style a web page using Bootstrap 4 and its components b) Create a responsive web page design and c) Make use of web tools to setup and manage web sites This course also includes an honors track that enables you to work on your own project developing a website using Bootstrap 4 Students enrolling in this course should have prior good working knowledge of HTML CSS and JavaScript"
  },
  {
    "_id": "635954942b40b3ffb69f3d54",
    "name": " Frontend Web Development Ceash Course ",
    "category_id": "02",
    "price": 150,
    "img": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://d15cw65ipctsrr.cloudfront.net/ea/961791a1904ea09af31999810fd916/Webserviceslogo.png?auto=format%2Ccompress&dpr=1&w=330&h=330&q=25&fit=fill",

    "info": "Front-End Web Development,Web Service,HTML,CSS,JavaScript,React",
    "about": "This specialization is geared toward beginning users who would like to learn and build Front-End Developer Skills. The courses in this series cover SOAP Web Services with JAX-WS, RESTful Web Services with JAX-Rs, and HTML - Front-End Developer among others, to help learners build a solid foundational knowledge."
  },
  {
    "_id": "63595494dfa290cd945b8b70",
    "name": "  CSS FrameWorks : Advanced Crash Course ",
    "category_id": "02",
    "price": 300,
    "img": "hhttps://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://s3.amazonaws.com/coursera-course-photos/54/a8edbfdb8040e89d9177b53c50492d/Logo.jpg?auto=format%2Ccompress&dpr=1&w=330&h=330&q=25&fit=fill",
    "info": "You will learn CSS,Tailwind,Bootstrap and some components",
    "about": "The web today is almost unrecognizable from the early days of white pages with lists of blue links  Now sites are designed with complex layouts unique fonts and customized color schemes This course will show you the basics of Cascading Style Sheets (CSS3)  The emphasis will be on learning how to write CSS rules how to test code and how to establish good programming habits When done correctly the styling of a webpage can take enhance your page.   When done incorrectly the result can be worse than no styling at all.    To ensure that your sites do not put up  barriers for people with cognitive and/or physical disabilities you will learn how to evaluate pages using the standardized POUR accessibility guidelines.    Upon completion of the course learners will be able to sketch a design for a given HTML page.  Using that design they will use CSS to implement the design by adding fonts colors and  layouts."
  },
  {
    "_id": "635954948540e32825c49fa5",
    "name": " IBM CyberSecurity Analyst",
    "category_id": "03",
    "price": 350,
    "img": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://d15cw65ipctsrr.cloudfront.net/67/6a8a23c93d424fa3a39138428681f3/Professional_Certificate_-_IBM_Cybersecurity_Analyst.png?auto=format%2Ccompress&dpr=1&w=330&h=330&fit=fill&q=25",

    "info": "You will learn Develop knowledge of cybersecurity analyst tools including data protection; endpoint protection; SIEM; and systems and network fundamentals Learn about key compliance and threat intelligence topics important in today’s cybersecurity landscape.Gain skills for incident responses and forensics with real-world cybersecurity case studies.Get hands-on experience to develop skills via industry specific and open source Security tools.",

    "about": "A growing number of exciting, well-paying jobs in today’s security industry do not require a college degree. This Professional Certificate will give you the technical skills to become job-ready for a Cybersecurity Analyst role. Instructional content and labs will introduce you to concepts including network security, endpoint protection, incident response, threat intelligence, penetration testing, and vulnerability assessment.Cybersecurity is one of the most in-demand career fields."
  },
  {
    "_id": "635954945de8292ee808f1f1",
    "name": "Ethical Hacking Essentials ",
    "category_id": "03",
    "price": 550,
    "img": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://s3.amazonaws.com/coursera-course-photos/69/a345609988487aa0c3bc217427e618/Ethical-Hacking-Essentials-EHE-.jpg?auto=format%2Ccompress&dpr=1&w=330&h=330&fit=fill&q=25",
    "info": "You will learn Fundamentals of information security and ethical hacking,Information security threats and vulnerabilities, types of malwares, and vulnerability assessments,Network-level attacks including sniffing, denial-of-service, and session hijacking, and their countermeasures,Application-level attacks including webserver exploitation, OWASP top10 attacks, and SQL injection and their countermeasures",
    "about": "Ethical Hacking Essentials is an introductory cybersecurity course that covers ethical hacking and penetration testing fundamentals and prepares learners for a career in cybersecurity. This course will introduce learners to computer and network security concepts such as threats and vulnerabilities, password cracking, web application attacks, IoT and OT attacks, cloud computing, pentesting fundamentals, and more.This course provides hands-on practical experience to learners thus giving them the skills necessary for a future in cybersecurity.EHE-certified learners have an assured means of formal recognition to add to their resumes and show off their expertise and skills to prospective employers. This improves their prospects for employment advancement, higher salaries, and greater job satisfaction."
  },
  {
    "_id": "63595494c6eb05af5d762d0d",
    "name": "Introduction to CyberSecurity ",
    "category_id": "03",
    "price": 300,
    "img": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://d15cw65ipctsrr.cloudfront.net/e5/5b94f0bb5811e78eb4ffb2bb669fdb/Introduction-to-Cyber-Security.png?auto=format%2Ccompress&dpr=1&w=330&h=330&fit=fill&q=25",
    "info": "Summarize the main purpose of cyber security as a discipline, basics of identification and authentication in cyber security,pros and cons of security through obscurity,Develop a lifelong learning plan for potential careers in cyber security",
    "about": "Introduction to Cyber Security was designed to help learners develop a deeper understanding of modern information and system protection technology and methods. The learning outcome is simple: We hope learners will develop a lifelong passion and appreciation for cyber security, which we are certain will help in future endeavors. Students, developers, managers, engineers, and even private citizens will benefit from this learning experience. Special customized interviews with industry partners were included to help connect the cyber security concepts to live business experiences."
  },

  {
    "_id": "63595494426e0686fbd9969a",
    "name": "Introduction to Data Science ",
    "category_id": "04",
    "price": 150,
    "img": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://d15cw65ipctsrr.cloudfront.net/32/d719a2d0d946d59e1151bc10ec29f5/Specialization-Certificate-Emblem---IDS---600x600.png?auto=format%2Ccompress&dpr=1&w=330&h=330&fit=fill&q=25",

    "info": "Describe what data science and machine learning are, their applications & use cases, and various types of tasks performed by data scientists,Gain hands-on familiarity with common data science tools including JupyterLab, R Studio, GitHub and Watson Studio,Develop the mindset to work like a data scientist, and follow a methodology to tackle different types of data science problems,Write SQL statements and query Cloud databases using Python from Jupyter notebooks",
    "about": "This Specialization will introduce you to what data science is and what data scientists do. You’ll discover the applicability of data science across fields, and learn how data analysis can help you make data driven decisions. You’ll find that you can kickstart your career path in the field without prior knowledge of computer science or programming languages: this Specialization will give you the foundation you need for more advanced learning to support your career goals.You’ll grasp concepts like big data, statistical analysis, and relational databases, and gain familiarity with various open source tools and data science programs used by data scientists, like Jupyter Notebooks, RStudio, GitHub, and SQL. You'll complete hands-on labs and projects to learn the methodology involved in tackling data science problems and apply your newly acquired skills and knowledge to real world data sets."
  },
  {
    "_id": "63595494ba3689da2f6ee5e9",
    "name": "Applied Data Science with Python ",
    "category_id": "04",
    "price": 150,
    "img": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://d15cw65ipctsrr.cloudfront.net/eb/8e18e0a4f111e59ae9c776a3dd0526/jhu-logo-thumb.png?auto=format%2Ccompress&dpr=1&w=330&h=330&fit=fill&q=25",
    "info": "This Specialization covers the concepts and tools you'll need throughout the entire data science pipeline, from asking the right kinds of questions to making inferences and publishing results. In the final Capstone Project, you’ll apply the skills learned by building a data product using real-world data. At completion, students will have a portfolio demonstrating their mastery of the material.",
    "about": "The 5 courses in this University of Michigan specialization introduce learners to data science through the python programming language. This skills-based specialization is intended for learners who have a basic python or programming background, and want to apply statistical, machine learning, information visualization, text analysis, and social network analysis techniques through popular python toolkits such as pandas, matplotlib, scikit-learn, nltk, and networkx to gain insight into their data.Introduction to Data Science in Python (course 1), Applied Plotting, Charting & Data Representation in Python (course 2), and Applied Machine Learning in Python (course 3) should be taken in order and prior to any other course in the specialization.  After completing those, courses 4 and 5 can be taken in any order.  All 5 are required to earn a certificate."
  },
  {
    "_id": "63595494e179458f102af141",
    "name": "Advanced Data Science with IBM ",
    "category_id": "04",
    "price": 200,
    "img": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://d15cw65ipctsrr.cloudfront.net/58/ab336088f511e8944e7b54193638b4/Specialization_Certificate_Emblem_-_AADS_-__Final.png?auto=format%2Ccompress&dpr=1&w=330&h=330&q=25&fit=fill",
    "info": "Learners will build fully scalable end to end data integration, machine learning and deep learning pipelines using the most prominent and widely used frameworks and technologies like Apache Spark, scikit-learn, SparkML, SystemML, TensorFlow, Keras, PyTorch, DeepLearning4J, Apache CouchDB and MQTT.",
    "abou": "This specialization completer you will have a proven deep understanding on massive parallel  data processing, data exploration and visualization, and advanced  machine learning & deep learning. You'll understand the  mathematical foundations behind all machine learning & deep learning  algorithms. You can apply knowledge in practical use cases, justify  architectural decisions, understand the characteristics of  different algorithms, frameworks & technologies & how they  impact model performance & scalability."
  },

  {
    "_id": "635954940a819e730d20d40c",
    "name": "Machine Learning ",
    "category_id": "05",
    "price": 450,
    "img": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://s3.amazonaws.com/coursera-course-photos/c4/b502505a3f495caa0ec3e00d0dc696/Machine-Learning-for-Everyone-image.jpg?auto=format%2Ccompress&dpr=1&w=330&h=330&q=25&fit=fill",
    "info": "This three-module course introduces machine learning and data science for everyone with a foundational understanding of machine learning models. You’ll learn about the history of machine learning, applications of machine learning, the machine learning model lifecycle, and tools for machine learning. You’ll also learn about supervised versus unsupervised learning, classification, regression, evaluating machine learning models, and more. Our labs give you hands-on experience with these machine learning and data science concepts. You will develop concrete machine learning skills as well as create a final project demonstrating your proficiency.After completing this program, you’ll be able to realize the potential of machine learning algorithms and artificial intelligence in different business scenarios. You’ll be able to identify when to use machine learning to explain certain behaviors and when to use it to predict future outcomes. You’ll also learn how to evaluate your machine learning models and to incorporate best practices. ",

    "about": "The Machine Learning Specialization is a foundational online program created in collaboration between DeepLearning.AI and Stanford Online. This beginner-friendly program will teach you the fundamentals of machine learning and how to use these techniques to build real-world AI applications.This Specialization is taught by Andrew Ng, an AI visionary who has led critical research at Stanford University and groundbreaking work at Google Brain, Baidu, and Landing.AI to advance the AI field.It provides a broad introduction to modern machine learning, including supervised learning (multiple linear regression, logistic regression, neural networks, and decision trees), unsupervised learning (clustering, dimensionality reduction, recommender systems), and some of the best practices used in Silicon Valley for artificial intelligence and machine learning innovation (evaluating and tuning models, taking a data-centric approach to improving performance, and more.) "
  },
  {
    "_id": "63595494bd5b4f8c0f13c8d8",
    "name": "AI for Everyone ",
    "category_id": "05",
    "price": 150,
    "img": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://s3.amazonaws.com/coursera-course-photos/41/763803169e4d31a5e7611bc928124b/Course-Logo.png?auto=format%2Ccompress&dpr=1&w=330&h=330&fit=fill&q=25",
    "info": "In this course, you will learn: meaning behind common AI terminology, including neural networks, machine learning, deep learning, and data science,What AI realistically can--and cannot--do,How to spot opportunities to apply AI to problems in your own organization,What it feels like to build machine learning and data science projects.",
    "about": "AI is not only for engineers. If you want your organization to become better at using AI, this is the course to tell everyone--especially your non-technical colleagues-to take. "
  },
  {
    "_id": "635954946ddd6a4401255b40",
    "name": "Introduction to Artificial Intelligence ",
    "category_id": "05",
    "price": 100,
    "img": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://s3.amazonaws.com/coursera-course-photos/f7/9812f978144ce8ac721727bc516cb0/Intro-to-AI-Naimo.jpg?auto=format%2Ccompress&dpr=1&w=330&h=330&q=25&fit=fill",
    "info": "In this course you will learn what Artificial Intelligence (AI) is, explore use cases and applications of AI, understand AI concepts and terms like machine learning, deep learning and neural networks. You will be exposed to various issues and concerns surrounding AI such as ethics and bias, & jobs, and get advice from experts about learning and starting a career in AI.  You will also demonstrate AI in action with a mini project.",
    "about": "This course can be applied to multiple Specializations or Professional Certificates programs. Completing this course will count towards your learning in any of the following programs:Key Technologies for Business Specialization,IBM Applied AI Professional Certificate,IBM & Darden Digital Strategy Specialization,AI Foundations for Everyone Specialization"
  },

  {
    "_id": "63595494c4c503ad9ca74714",
    "name": "Deep Learning ",
    "category_id": "05",
    "price": 400,
    "img": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://d15cw65ipctsrr.cloudfront.net/a4/079d5e7c7b45ac9107f22bfcfeab91/Specialization-logo.png?auto=format%2Ccompress&dpr=1&w=330&h=330&fit=fill&q=25",
    "info": "In this Specialization, you will build and train neural network architectures such as Convolutional Neural Networks, Recurrent Neural Networks, LSTMs, Transformers, and learn how to make them better with strategies such as Dropout, BatchNorm, Xavier/He initialization, and more. Get ready to master theoretical concepts and their industry applications using Python and TensorFlow and tackle real-world cases such as speech recognition, music synthesis, chatbots, machine translation, natural language processing, and more.",
    "about": "In this Specialization, you will build and train neural network architectures such as Convolutional Neural Networks, Recurrent Neural Networks, LSTMs, Transformers, and learn how to make them better with strategies such as Dropout, BatchNorm, Xavier/He initialization, and more. Get ready to master theoretical concepts and their industry applications using Python and TensorFlow and tackle real-world cases such as speech recognition, music synthesis, chatbots, machine translation, natural language processing, and more.AI is transforming many industries. The Deep Learning Specialization provides a pathway for you to take the definitive step in the world of AI by helping you gain the knowledge and skills to level up your career. Along the way, you will also get career advice from deep learning experts from industry and academia."
  },

  {
    "_id": "6359549487023e7a8c226c05",
    "name": "Data Structure and Algorithms ",
    "category_id": "06",
    "price": 150,
    "img": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://d15cw65ipctsrr.cloudfront.net/2a/34a150d9ad11e5bd22cb7d7d7686df/logo3.png?auto=format%2Ccompress&dpr=1&w=330&h=330&fit=fill&q=25",
    "info": "The specialization contains two real-world projects: Big Networks and Genome Assembly. You will analyze both road networks and social networks and will learn how to compute the shortest route between New York and San Francisco 1000 times faster than the shortest path algorithms you learn in the standard Algorithms 101 course! Afterwards, you will learn how to assemble genomes from millions of short fragments of DNA and how assembly algorithms fuel recent developments in personalized medicine.Play with 50 algorithmic puzzles on your smartphone to develop your algorithmic intuition!  Apply algorithmic techniques (greedy algorithms, binary search, dynamic programming, etc.) and data structures (stacks, queues, trees, graphs, etc.) to solve 100 programming challenges that often appear at interviews at high-tech companies. Get an instant feedback on whether your solution is correct.Apply the newly learned algorithms to solve real-world challenges: navigating in a Big Network  or assembling a genome of a deadly pathogen from millions of short substrings of its DNA.",
    "about": "Computer science legend Donald Knuth once said “I don’t understand things unless I try to program them.” We also believe that the best way to learn an algorithm is to program it. However, many excellent books and online courses on algorithms, that excel in introducing algorithmic ideas, have not yet succeeded in teaching you how to implement algorithms, the crucial computer science skill that you have to master at your next job interview. We tried to fill this gap by forming a diverse team of instructors that includes world-leading experts in theoretical and applied algorithms at UCSD (Daniel Kane, Alexander Kulikov, and Pavel Pevzner) and a former software engineer at Google (Neil Rhodes). This unique combination of skills makes this Specialization different from other excellent MOOCs on algorithms that are all developed by theoretical computer scientists. While these MOOCs focus on theory, our Specialization is a mix of algorithmic theory/practice/applications with software engineering. You will learn algorithms by implementing nearly 100 coding problems in a programming language of your choice. To the best of knowledge, no other online course in Algorithms comes close to offering you a wealth of programming challenges (and puzzles!) that you may face at your next job interview. We invested over 3000 hours into designing our challenges as an alternative to multiple choice questions that you usually find in MOOCs.  "
  },
  {
    "_id": "63595494a88ff020c73babf1",
    "name": "Algorithms for Beginners ",
    "category_id": "06",
    "price": 150,
    "img": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://d15cw65ipctsrr.cloudfront.net/5e/41de00794811e682cb918e3e406e4d/cs161logo.png?auto=format%2Ccompress&dpr=1&w=330&h=330&fit=fill&q=25",
    "info": "Learners will practice and master the fundamentals of algorithms through several types of assessments.  Every week, there is a multiple choice quiz to test your understanding of the most important concepts.  There are also weekly programming assignments, where you implement one of the algorithms covered in lecture in a programming language of your choosing.  Each course concludes with a multiple-choice final exam. This specialization is an introduction to algorithms for learners with at least a little programming experience.  The specialization is rigorous but emphasizes the big picture and conceptual understanding over low-level implementation and mathematical details.  After completing this specialization, you will be well-positioned to ace your technical interviews and speak fluently about algorithms with other programmers and computer scientists.",
    "about": "Algorithms are the heart of computer science, and the subject has countless practical applications as well as intellectual depth.  This specialization is an introduction to algorithms for learners with at least a little programming experience.  The specialization is rigorous but emphasizes the big picture and conceptual understanding over low-level implementation and mathematical details.  After completing this specialization, you will be well-positioned to ace your technical interviews and speak fluently about algorithms with other programmers and computer scientists."
  },
  {
    "_id": "635954949f2962fb21706830",
    "name": "Data Mining ",
    "category_id": "06",
    "price": 300,
    "img": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://d15cw65ipctsrr.cloudfront.net/96/64e89ae5534cbcbdc81c1e47f2a121/data_mining_spec_logo_adjusted_with_text.png?auto=format%2Ccompress&dpr=1&w=330&h=330&fit=fill&q=25",
    "info": "Data mining pipeline: data understanding, preprocessing, warehousing,Data mining methods: frequent patterns, classification, clustering, outliers ,Data mining project: project formulation, design, implementation, reporting.B​y the end of this course, you will be able to identify the key components of the data mining pipeline ​and describe how they're related.",
    "about": "The Data Mining Specialization teaches data mining techniques for both structured data which conform to a clearly defined schema, and unstructured data which exist in the form of natural language text. Specific course topics include pattern discovery, clustering, text retrieval, text mining and analytics, and data visualization. The Capstone project task is to solve real-world data mining challenges using a restaurant review data set from Yelp."
  }
]
