[
  {
    "_id": "0282e0e58a5c404fbd15261f11c2ab6a",
    "others_info": {
      "is_todays_pick": false,
      "is_trending": true
    },
    "category_id": "01",

    "price": 150,
    "title": "Introduction to AI",
    "author": "Tim RoughGarden",

    "image_url": "https://cdn.educba.com/academy/wp-content/uploads/2019/03/Introduction-to-Artificial-Intelligence.png",

    "about": " In this course you will learn what Artificial Intelligence (AI)  is, explore use cases and applications of AI, understand AI concepts and terms like machine learning, deep learning and neural networks. You will be exposed to various issues and concerns surrounding AI such as ethics and bias, & jobs, and get advice from experts about learning and starting a career in AI.  You will also demonstrate AI in action with a mini project.This course does not require any programming or computer science expertise and is designed to introduce the basics of AI to anyone whether you have a technical background or not.",

    "details": "Artificial Intelligence (AI) is no longer science fiction. It is rapidly permeating all industries and having a profound impact on virtually every aspect of our existence. Whether you are an executive, a leader, an industry professional, a researcher, or a student - understanding AI, its impact and transformative potential for your organization and our society is of paramount importance.This specialization is designed for those with little or no background in AI, whether you have technology background or not, and does not require any programming skills. It is designed to give you a firm understanding of what is AI, its applications and use cases across various industries. You will become acquainted with terms like Machine Learning, Deep Learning and Neural Networks.Furthermore, it will familiarize you with IBM Watson AI services that enable any business to quickly and easily employ pre-built AI smarts to their products and solutions. You will also learn about creating intelligent virtual assistants and how they can be leveraged in different scenarios.By the end of this specialization, learners will have had hands-on interactions with several AI environments and applications, and have built and deployed an AI enabled chatbot on a website – without any coding. "
  },
  {
    "_id": "0282e0e58a5c404fbd15261f11c2ab6b",
    "others_info": {
      "is_todays_pick": false,
      "is_trending": true
    },
    "category_id": "02",

    "price": 299,
    "title": "Python for Beginners",
    "author": "Charles Russesl Severance",
    "image_url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSbCRRUEHnTZViCujk0UgPIguOOlcXSZ_Oa_g&usqp=CAU",

    "about": "This course aims to teach everyone the basics of programming computers using Python. We cover the basics of how one constructs a program from a series of simple instructions in Python.  The course has no pre-requisites and avoids all but the simplest mathematics. Anyone with moderate computer experience should be able to master the materials in this course. This course will cover Chapters 1-5 of the textbook “Python for Everybody”.  Once a student completes this course, they will be ready to take more advanced programming courses. This course covers Python 3.",

    "details": "This Specialization builds on the success of the Python for Everybody course and will introduce fundamental programming concepts including data structures, networked application program interfaces, and databases, using the Python programming language. In the Capstone Project, you’ll use the technologies learned throughout the Specialization to design and create your own  applications for data retrieval, processing, and visualization."
  },

  {
    "_id": "f69a695f037cd9484cecaea37ca71011",
    "others_info": {
      "is_todays_pick": false,
      "is_trending": true
    },
    "category_id": "03",
    "price": 350,
    "title": "Machine Learning : Beginners to Advance",
    "author": "Andrew Ng",
    "image_url": "https://www.inventateq.com/assets/machine-banner.png",

    "about": "Build machine learning models in Python using popular machine learning libraries NumPy and scikit-learn.• Build and train supervised machine learning models for prediction and binary classification tasks, including linear regression and logistic regression.• Build and train a neural network with TensorFlow to perform multi-class classification.• Apply best practices for machine learning development so that your models generalize to data and tasks in the real world.• Build and use decision trees and tree ensemble methods, including random forests and boosted trees.• Use unsupervised learning techniques for unsupervised learning: including clustering and anomaly detection.• Build recommender systems with a collaborative filtering approach and a content-based deep learning method.• Build a deep reinforcement learning model.",

    "details": " In this course you will learn Distinction between artificial intelligence, machine learning, data science, and statistical analysis,various types of machine learning with real-world examples such as regression, classification, decision trees, and deep learning,How to evaluate and frame business problems for potential machine learning applications,Brief survey of available tools, datasets, and resources common in the machine learning space.,Limitations, potential pitfalls, and ethical considerations around machine learning.By the end of this Specialization,you will have mastered key concepts and gained the practical know-how to quickly and powerfully apply machine learning to challenging real-world problems.If you’re looking to break into AI or build a career in machine learning,the new Machine Learning Specialization is the best place to start."
  },
  {
    "_id": "f69a695f037cd9484cecaea37ca71012",
    "others_info": {
      "is_todays_pick": false,
      "is_trending": true
    },
    "category_id": "04",

    "price": 400,
    "title": "An Introduction to Ethical Hacking",
    "author": "Robert Charles",

    "image_url": "https://cdn.mindmajix.com/courses/ethical-hacking-training.png",

    "about": "Ethical Hacking Essentials is an introductory cybersecurity course that covers ethical hacking and penetration testing fundamentals and prepares learners for a career in cybersecurity. This course will introduce learners to computer and network security concepts such as threats and vulnerabilities, password cracking, web application attacks, IoT and OT attacks, cloud computing, pentesting fundamentals, and more.This course provides hands-on practical experience to learners thus giving them the skills necessary for a future in cybersecurity.EHE-certified learners have an assured means of formal recognition to add to their resumes and show off their expertise and skills to prospective employers. This improves their prospects for employment advancement, higher salaries, and greater job satisfaction.",

    " details": "This Specialization can be taken by students.IT professionals, IT managers,career changers, and anyone who seeks a cybersecurity career or aspires to advance their current role.This course is ideal for those entering the cybersecurity workforce,providing foundational,hands-on skills to solve the most common security issues organizations face today.This course Specialization will help you gain core cybersecurity skills needed to protect critical data, networks, and digital assets. You will learn to build the foundation that enables individuals to grow their skills in specialized domains like penetration testing, security consulting, auditing, and system and network administration."
  },

  {
    "_id": "11468ed61aee84de492a8b04158a22f9",
    "others_info": {
      "is_todays_pick": false,
      "is_trending": false
    },
    "category_id": "05",

    "price": 180,
    "title": "Python Advanceed Crash Course",
    "author": "Howard Poston",

    "image_url": "https://i.ytimg.com/vi/RMoYiCRAFlk/maxresdefault.jpg",
    "about": "Welcome to advanced Python for Cybersecurity. The Reconnaissance course demonstrates the use of Python to automate the process of performing reconnaissance on target environments. We will also demonstrate how Python can be used to automate a password guessing attach to gain initial access to a target environment.",

    "details": "Python is one of the most popular and widely-used programming languages in the world, due to its high usability and large collection of libraries. This learning path provides an application-driven introduction to using advanced Python features for offensive and defense cybersecurity. This path demonstrates how some of the advanced functionality in Python packages can be applied to cybersecurity and how to automate multi-stage attack chains and defensive operations using Python. This Advanced Python Scripting for Cybersecurity Skills Path builds on the Python for Cybersecurity skills path to demonstrate advanced applications of Python for cybersecurity."
  },
  {
    "_id": "11468ed61aee84de492a8b04158a22f0",
    "others_info": {
      "is_todays_pick": false,
      "is_trending": false
    },
    "category_id": "06",

    "price": 400,
    "title": "Data Structures and Algorithm",
    "author": "Neil Rhodes",

    "image_url": "https://i.ytimg.com/vi/8hly31xKli0/maxresdefault.jpg",

    "about": "The specialization contains two real-world projects: Big Networks and Genome Assembly. You will analyze both road networks and social networks and will learn how to compute the shortest route between New York and San Francisco 1000 times faster than the shortest path algorithms you learn in the standard Algorithms 101 course! Afterwards, you will learn how to assemble genomes from millions of short fragments of DNA and how assembly algorithms fuel recent developments in personalized medicine.",

    "details": "Computer science legend Donald Knuth once said “I don’t understand things unless I try to program them.” We also believe that the best way to learn an algorithm is to program it. However, many excellent books and online courses on algorithms, that excel in introducing algorithmic ideas, have not yet succeeded in teaching you how to implement algorithms, the crucial computer science skill that you have to master at your next job interview. We tried to fill this gap by forming a diverse team of instructors that includes world-leading experts in theoretical and applied algorithms at UCSD (Daniel Kane, Alexander Kulikov, and Pavel Pevzner) and a former software engineer at Google (Neil Rhodes). This unique combination of skills makes this Specialization different from other excellent MOOCs on algorithms that are all developed by theoretical computer scientists. While these MOOCs focus on theory, our Specialization is a mix of algorithmic theory/practice/applications with software engineering. You will learn algorithms by implementing nearly 100 coding problems in a programming language of your choice. To the best of knowledge, no other online course in Algorithms comes close to offering you a wealth of programming challenges (and puzzles!) that you may face at your next job interview. We invested over 3000 hours into designing our challenges as an alternative to multiple choice questions that you usually find in MOOCs.  "
  }
]
